#----------------------------------------------------------------------------------------------------------------------
#
#สวัสดีครับวันนี้ผมอาจจะมาแปลกหน่อยเเต่หนังสือที่อ่านวันนี้คือหนังสือ python เบื้องต้น เเละผมเองก็พึ่งมาเรียนภาษานี้
#วิธีการติดตั้งผมจะทิ้งไว้ที่โพสต์เลยนะครับผม
#ไวยากรณ์ของภาษา Python ภาษา Python นั้นถูกพัฒนาขึ้นมาโดยมีความตั้งใจว่าจะให้เป็นภาษาที่อ่านง่าย 
# มันถูกออกแบบมาให้มีโครงสร้างที่มองเห็นได้โดยไม่ซับซ้อน โดยมักจะใช้คำในภาษาอังกฤษในขณะที่ภาษาอื่นใช้เครื่องหมายวรรคตอน นอกจากนี้ Python 
# มีข้อยกเว้นของโครงสร้างทางภาษาน้อยกว่าภาษา C และ Pascal Python Interpreter Python interpreter นั้นเป็นตัวแปรภาษาของภาษา Python 
# เพื่อให้สามารถรันโค้ด Python ได้ ซึ่งได้มากับไลบรารี่มาตรฐานที่สามารถใช้งานได้ฟรี
#
#----------------------------------------------------------------------------------------------------------------------
#----------------------------------------------------------------------------------------------------------------------
#คำส่งรันTerminalใน Visual Studio Code
#python [-ชื่อที่เราตั้ง-].py
#
#----------------------------------------------------------------------------------------------------------------------
#----------------------------------------------------------------------------------------------------------------------
#
#[-#-]มันมีว่าใช้สำหรับเป็นคำอธิบายโค้ด(Line comment)
#
#----------------------------------------------------------------------------------------------------------------------
#
#keyword ของภาษา python
import keyword
print(keyword.kwlist)
#
#----------------------------------------------------------------------------------------------------------------------
#
#statement คือคำสั้งที่สมบรูณ์ซึ่งโปรแกรมสามารถนำไปใช้ในการประมวลผลเพื่อการกระทำบางอย่างได้โดยมีสองเเบบคือ
#single statement คือ statement คำสั่งเดียว
#compound statement คือ statement ที่มีหลายคำสั่ง หรือมี Statement ย่อยๆ หลายอันรวมกัน
#
#python จะถือว่าโค้ดในบรรทัดเดียวกัน คือคำสั่งเดียวกัน เเละเมื่อขึ้นบรรทัดใหม่ก็ถือว่าเป็นคำสั่งใหม่ ดังนั้น จึงไม่จำเป็นต้องใช้เครื่องหมาย Semicolon(;) เพื่อเเสดงจุดสิ้นสุดคำสั่งเหมือนในภาษาอืนๆ
#----------------------------------------------------------------------------------------------------------------------

#เครื่องคิดเลขง่ายๆภายใน 1 บรรทัด
a = 77; b = 88; c = a + b; print(c) #ถือเป็น single statement

a = 10 #ถือเป็น compound statement
b = 88
c = a + b
print(c)

