#----------------------------------------------------------------------------------------------------------------------
#
#สวัสดีครับวันนี้ผมอาจจะมาแปลกหน่อยเเต่หนังสือที่อ่านวันนี้คือหนังสือ python เบื้องต้น เเละผมเองก็พึ่งมาเรียนภาษานี้
#วิธีการติดตั้งผมจะทิ้งไว้ที่โพสต์เลยนะครับผม
#ไวยากรณ์ของภาษา Python ภาษา Python นั้นถูกพัฒนาขึ้นมาโดยมีความตั้งใจว่าจะให้เป็นภาษาที่อ่านง่าย 
# มันถูกออกแบบมาให้มีโครงสร้างที่มองเห็นได้โดยไม่ซับซ้อน โดยมักจะใช้คำในภาษาอังกฤษในขณะที่ภาษาอื่นใช้เครื่องหมายวรรคตอน นอกจากนี้ Python 
# มีข้อยกเว้นของโครงสร้างทางภาษาน้อยกว่าภาษา C และ Pascal Python Interpreter Python interpreter นั้นเป็นตัวแปรภาษาของภาษา Python 
# เพื่อให้สามารถรันโค้ด Python ได้ ซึ่งได้มากับไลบรารี่มาตรฐานที่สามารถใช้งานได้ฟรี
#
#----------------------------------------------------------------------------------------------------------------------
#
#----------------------------------------------------------------------------------------------------------------------
#คำส่งรันTerminalใน Visual Studio Code
#python [-ชื่อที่เราตั้ง-].py
#
#----------------------------------------------------------------------------------------------------------------------

#เครื่องคิดเลขง่ายๆ
a = 77; b = 88; c = a + b; print(c)